FROM python:3.13-slim

WORKDIR /app

# apt-get update - обновляет индекс пакетов в системе (список доступных пакетов и их версий).
# apt-get install -y - устанавливает пакеты. -y автоматически отвечает «да» на все запросы во время установки, чтобы процесс не останавливался.
## Пакеты, которые устанавливаются:
# build-essential — базовый набор инструментов для компиляции программ на C/C++ (gcc, g++, make и т.д.). Нужен, если твои Python-пакеты требуют сборки из исходников.
# curl — утилита для загрузки файлов по HTTP/HTTPS. Часто используется для скачивания скриптов или данных.
# software-properties-common — пакет для управления репозиториями, позволяет добавлять PPA и другие источники программ.
# git — система контроля версий. Позволяет клонировать репозитории с GitHub или других источников.
# rm -rf /var/lib/apt/lists/* — удаляет кеш с информацией о пакетах, который был загружен командой apt-get update. Это уменьшает размер образа, потому что после установки пакетов эта информация уже не нужна.
# && — соединяет команды: следующая выполняется только если предыдущая прошла успешно.
# \ в конце строки — это перенос команды на следующую строку для удобочитаемости. Docker воспринимает её как одну команду.

RUN apt-get update && \
    apt-get install -y build-essential python3-dev && \
    rm -rf /var/lib/apt/lists/*

COPY requirements.txt .  
COPY . .

RUN pip3 install --no-cache-dir -r requirements.txt

EXPOSE 8501
CMD ["streamlit", "run", "main.py", "--server.port=8501", "--server.address=0.0.0.0"]
